org/system/kali/20230428-kali.org
:PROPERTIES:
:ID:       012bd2a5-d0f0-4b34-911c-03bfee59e8be
:ROAM_ALIASES: "KALI カーリー"
:END:
#+title: Kali Linux

-> [[id:050e9166-394b-40bb-8135-a45ab4419153][MAIN メイン]] -> [[id:b0d37831-1dcd-47be-ba0b-3bd8a7df063e][LINUX リナックス]]

* install
install is simple GUI, remember you can "Use biggest partition", so you can install it alongside Windows or Another system.

** apps
first, update with
~# apt update~
then upgrade all packages with
~# apt upgrade~

*** syncthing
**** install
install with:
~# apt -y install syncthing~

*** doas
~# apt -y install doas~

* install
install is simple GUI, remember you can "Use biggest partition", so you can install it alongside Windows or Another system.

** apps
first, update with
~# apt update~
then upgrade all packages with
~# apt upgrade~

*** syncthing
**** install
install with:
~# apt -y install syncthing~

*** doas
~# apt -y install doas~

* setting up my desktop
** EMACS SCRIPT
** JAPANESE FCITX5+MOZC

* CHROOT
on your linux install or live usb, do as follows
~# mount /dev/<root-partition> /mnt~
~# mount /dev/<boot-partition> /mnt/boot/efi~

mounting some stuff
~# mount --bind /dev /mnt/dev &&~
~# mount --bind /dev/pts /mnt/dev/pts &&~
~# mount --bind /proc /mnt/proc &&~
~# mount --bind /sys /mnt/sys~

the chrooting
~# sudo chroot /mnt /bin/bash~
-> ~/bin/bash~ to specify a shell, as in my case i use [dash]

the installing
~# grub-install --target=x86_64-efi --efi-directory=/boot/efi --removable~

unmounting and saving
~$ exit &&~
~# umount /mnt/sys &&~
~# umount /mnt/proc &&~
~# umount /mnt/dev/pts &&~
~# umount /mnt/dev &&~
~# umount /mnt~
