public/system/kali/20230428-kali.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Kali Linux</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Kali Linux</h1>
<p>
-&gt; <a href="../../index.html#ID-050e9166-394b-40bb-8135-a45ab4419153">MAIN メイン</a> -&gt; <a href="../../study/linux/20230428-linux.html#ID-b0d37831-1dcd-47be-ba0b-3bd8a7df063e">LINUX リナックス</a>
</p>

<div id="outline-container-org3b20d04" class="outline-2">
<h2 id="org3b20d04">install</h2>
<div class="outline-text-2" id="text-org3b20d04">
<p>
install is simple GUI, remember you can "Use biggest partition", so you can install it alongside Windows or Another system.
</p>
</div>

<div id="outline-container-org77a2533" class="outline-3">
<h3 id="org77a2533">apps</h3>
<div class="outline-text-3" id="text-org77a2533">
<p>
first, update with
<code># apt update</code>
then upgrade all packages with
<code># apt upgrade</code>
</p>
</div>

<div id="outline-container-org606eda8" class="outline-4">
<h4 id="org606eda8">syncthing</h4>
<div class="outline-text-4" id="text-org606eda8">
</div>
<ul class="org-ul">
<li><a id="org5655380"></a>install<br />
<div class="outline-text-5" id="text-org5655380">
<p>
install with:
<code># apt -y install syncthing</code>
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-org798d7d3" class="outline-4">
<h4 id="org798d7d3">doas</h4>
<div class="outline-text-4" id="text-org798d7d3">
<p>
<code># apt -y install doas</code>
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org04e3fc0" class="outline-2">
<h2 id="org04e3fc0">install</h2>
<div class="outline-text-2" id="text-org04e3fc0">
<p>
install is simple GUI, remember you can "Use biggest partition", so you can install it alongside Windows or Another system.
</p>
</div>

<div id="outline-container-org6ac9e2d" class="outline-3">
<h3 id="org6ac9e2d">apps</h3>
<div class="outline-text-3" id="text-org6ac9e2d">
<p>
first, update with
<code># apt update</code>
then upgrade all packages with
<code># apt upgrade</code>
</p>
</div>

<div id="outline-container-orgbe1c80b" class="outline-4">
<h4 id="orgbe1c80b">syncthing</h4>
<div class="outline-text-4" id="text-orgbe1c80b">
</div>
<ul class="org-ul">
<li><a id="org4c7b0ee"></a>install<br />
<div class="outline-text-5" id="text-org4c7b0ee">
<p>
install with:
<code># apt -y install syncthing</code>
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-org7c29415" class="outline-4">
<h4 id="org7c29415">doas</h4>
<div class="outline-text-4" id="text-org7c29415">
<p>
<code># apt -y install doas</code>
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd81b5f4" class="outline-2">
<h2 id="orgd81b5f4">setting up my desktop</h2>
<div class="outline-text-2" id="text-orgd81b5f4">
</div>
<div id="outline-container-org03d5973" class="outline-3">
<h3 id="org03d5973">EMACS SCRIPT</h3>
</div>
<div id="outline-container-orgbdb9f38" class="outline-3">
<h3 id="orgbdb9f38">JAPANESE FCITX5+MOZC</h3>
</div>
</div>

<div id="outline-container-orgdbaf6ea" class="outline-2">
<h2 id="orgdbaf6ea">CHROOT</h2>
<div class="outline-text-2" id="text-orgdbaf6ea">
<p>
on your linux install or live usb, do as follows
<code># mount /dev/&lt;root-partition&gt; /mnt</code>
<code># mount /dev/&lt;boot-partition&gt; /mnt/boot/efi</code>
</p>

<p>
mounting some stuff
<code># mount --bind /dev /mnt/dev &amp;&amp;</code>
<code># mount --bind /dev/pts /mnt/dev/pts &amp;&amp;</code>
<code># mount --bind /proc /mnt/proc &amp;&amp;</code>
<code># mount --bind /sys /mnt/sys</code>
</p>

<p>
the chrooting
<code># sudo chroot /mnt /bin/bash</code>
-&gt; <code>/bin/bash</code> to specify a shell, as in my case i use [dash]
</p>

<p>
the installing
<code># grub-install --target=x86_64-efi --efi-directory=/boot/efi --removable</code>
</p>

<p>
unmounting and saving
<code>$ exit &amp;&amp;</code>
<code># umount /mnt/sys &amp;&amp;</code>
<code># umount /mnt/proc &amp;&amp;</code>
<code># umount /mnt/dev/pts &amp;&amp;</code>
<code># umount /mnt/dev &amp;&amp;</code>
<code># umount /mnt</code>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.0.50 (<a href="https://orgmode.org">Org</a> mode 9.6.6)</p>
</div>
</body>
</html>